package ru.geekbrains.homework3;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

/**
 * -- ДЗ-3
 * 1. Доделать сервис управления книгами:
 * 1.1 Реализовать контроллер по управлению книгами с ручками:
 * * GET /book/{id} - получить описание книги,
 * * DELETE /book/{id} - удалить книгу,
 * * POST /book - создать книгу
 * 1.2 Реализовать контроллер по управлению читателями (аналогично контроллеру с книгами из 1.1)
 * 1.3 В контроллере IssueController добавить ресурс GET /issue/{id} - получить описание факта выдачи
 * 2.1 В сервис IssueService добавить проверку, что у пользователя на руках нет книг.
 * * Если есть - не выдавать книгу (статус ответа - 409 Conflict)
 * 2.2 В сервис читателя добавить ручку
 * * GET /reader/{id}/issue - вернуть список всех выдачей для данного читателя
 *
 * -- ДЗ-4
 * 1. В предыдущий проект (где была библиотека с книгами, выдачами и читателями) добавить следующие рерурсы,
 * * которые возвращают готовые HTML-страницы (т.е. это просто Controller'ы):
 * * 1.1 /ui/books - на странице должен отобразиться список
 *   всех доступных книг в системе
 * * 1.2 /ui/reader - аналогично 1.1
 * * 1.3 /ui/issues - на странице отображается таблица,
 *   в которой есть столбцы (книга, читатель, когда взял,
 *   когда вернул (если не вернул - пустая ячейка)).
 * * 1.4* /ui/reader/{id} - страница,
 * где написано имя читателя с идентификатором id и перечислены книги,
 * которые на руках у этого читателя
 */
@SpringBootApplication
public class Main {

	public static void main(String[] args) {
		SpringApplication.run(Main.class, args);
	}

}
