'''
Задача 22: Даны два неупорядоченных набора целых чисел (может быть, 
с повторениями). Выдать без повторений в порядке возрастания все те числа, 
которые встречаются в обоих наборах.
Пользователь вводит 2 числа. 
n - кол-во элементов первого множества. 
m - кол-во элементов второго множества. 
Затем пользователь вводит сами элементы множеств
Пример:
11 6
2 4 6 8 10 12 10 8 6 4 2
3 6 9 12 15 18

6 12
'''
n = int(input('Введите количество элементов первого множества--> '))
m = int(input('Введите количество элементов второго множества--> '))
my_list_1 = []
my_list_2 = []
for i in range(n):
    my_list_1.append(int(input('Введите элемент первого множества --> ')))
for i in range(m):
    my_list_2.append(int(input('Введите элемент втрого множества --> ')))

print(*sorted(set(my_list_1).intersection(set(my_list_2))))